In [5]:
import pandas as pd
import numpy as np

In [1]:
print("Hello notebooks")

Hello notebooks

In [7]:
numbers_list = np.arange(0,8)
numbers_list

array([0, 1, 2, 3, 4, 5, 6, 7])

In [8]:
type(numbers_list)

numpy.ndarray

In [2]:
print("Hello")

Hello

In [35]:
list1= ["Alice", "Joel", "Ariel", "Hannah", "Josh", "Abby", "Uriel", "Alex"]
list2 = [18, 19, 23, 18, 24, 22, 23, 21]
list3 = ["Female", "Male", "Female", "Female", "Male", "Male", "Female", "Male"]

In [36]:
# 
# Create a DataFrame out of the lists (arrays) above 
dataframe = pd.DataFrame({"Name": list1,
                          "Age": list2,
                          "Gender" : list3 })

In [37]:
# 
# Show the Dataframe created above
dataframe

     Name  Age  Gender
0   Alice   18  Female
1    Joel   19    Male
2   Ariel   23  Female
3  Hannah   18  Female
4    Josh   24    Male
5    Abby   22    Male
6   Uriel   23  Female
7    Alex   21    Male

In [38]:
#
# Create one column (of list values and labels as index)
# 
                    # |-----------|--------------------------------------------------------------------------|
                    # | Index     | Value                                                                    |
                    # |--------------------------------------------------------------------------------------|
                    # | Name      | ["Alice", "Joel", "Ariel", "Hannah", "Josh", "Abby", "Uriel", "Alex"]    |
                    # |-----------|--------------------------------------------------------------------------|
                    # | Age       | [18, 19, 23, 18, 24, 22, 23, 21]                                         |
                    # |-----------|--------------------------------------------------------------------------|
                    # | Gender    | ["Female", "Male", "Female", "Female", "Male", "Male", "Female", "Male"] |
                    # |-----------|--------------------------------------------------------------------------|

dataframe_1 = pd.Series({"Name": list1,
                         "Age": list2,
                         "Gender": list3
                        })

In [39]:
dataframe_1

Name      [Alice, Joel, Ariel, Hannah, Josh, Abby, Uriel...
Age                        [18, 19, 23, 18, 24, 22, 23, 21]
Gender    [Female, Male, Female, Female, Male, Male, Fem...
dtype: object

In [40]:
pd.Series(dataframe['Name'])

0     Alice
1      Joel
2     Ariel
3    Hannah
4      Josh
5      Abby
6     Uriel
7      Alex
Name: Name, dtype: object

In [41]:
# 
# Show the first 3 rows of the DataFrame
dataframe.head(3)

    Name  Age  Gender
0  Alice   18  Female
1   Joel   19    Male
2  Ariel   23  Female

In [24]:
# 
# Show the last 2 rows of the DataFrame
dataframe.tail(2)

    Name  Age  Gender
6  Uriel   23  Female
7   Alex   21    Male

In [42]:
# 
# Show summary of the table
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    8 non-null      object
 1   Age     8 non-null      int64
 2   Gender  8 non-null      object
dtypes: int64(1), object(2)
memory usage: 320.0+ bytes

In [43]:
# 
# Show all the unique values in the 'Age' column
dataframe['Age'].unique()

array([18, 19, 23, 24, 22, 21])

In [46]:
# 
# Give a summary of the columns with textual data values
dataframe.describe(include='object')

         Name  Gender
count       8       8
unique      8       2
top     Alice  Female
freq        1       4